{
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "dtype": "float32",
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "Apple___Apple_scab",
    "1": "Apple___Black_rot",
    "10": "Corn_(maize)___healthy",
    "11": "Grape___Black_rot",
    "12": "Grape___Esca_(Black_Measles)",
    "13": "Grape___Leaf_blight_(Isariopsis_Leaf_Spot)",
    "14": "Grape___healthy",
    "15": "Orange___Haunglongbing_(Citrus_greening)",
    "16": "Peach___Bacterial_spot",
    "17": "Peach___healthy",
    "18": "Pepper,_bell___Bacterial_spot",
    "19": "Pepper,_bell___healthy",
    "2": "Apple___Cedar_apple_rust",
    "20": "Potato___Early_blight",
    "21": "Potato___Late_blight",
    "22": "Potato___healthy",
    "23": "Raspberry___healthy",
    "24": "Soybean___healthy",
    "25": "Squash___Powdery_mildew",
    "26": "Strawberry___Leaf_scorch",
    "27": "Strawberry___healthy",
    "28": "Tomato___Bacterial_spot",
    "29": "Tomato___Early_blight",
    "3": "Apple___healthy",
    "30": "Tomato___Late_blight",
    "31": "Tomato___Leaf_Mold",
    "32": "Tomato___Septoria_leaf_spot",
    "33": "Tomato___Spider_mites Two-spotted_spider_mite",
    "34": "Tomato___Target_Spot",
    "35": "Tomato___Tomato_Yellow_Leaf_Curl_Virus",
    "36": "Tomato___Tomato_mosaic_virus",
    "37": "Tomato___healthy",
    "4": "Blueberry___healthy",
    "5": "Cherry_(including_sour)___Powdery_mildew",
    "6": "Cherry_(including_sour)___healthy",
    "7": "Corn_(maize)___Cercospora_leaf_spot Gray_leaf_spot",
    "8": "Corn_(maize)___Common_rust_",
    "9": "Corn_(maize)___Northern_Leaf_Blight"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Apple___Apple_scab": "0",
    "Apple___Black_rot": "1",
    "Apple___Cedar_apple_rust": "2",
    "Apple___healthy": "3",
    "Blueberry___healthy": "4",
    "Cherry_(including_sour)___Powdery_mildew": "5",
    "Cherry_(including_sour)___healthy": "6",
    "Corn_(maize)___Cercospora_leaf_spot Gray_leaf_spot": "7",
    "Corn_(maize)___Common_rust_": "8",
    "Corn_(maize)___Northern_Leaf_Blight": "9",
    "Corn_(maize)___healthy": "10",
    "Grape___Black_rot": "11",
    "Grape___Esca_(Black_Measles)": "12",
    "Grape___Leaf_blight_(Isariopsis_Leaf_Spot)": "13",
    "Grape___healthy": "14",
    "Orange___Haunglongbing_(Citrus_greening)": "15",
    "Peach___Bacterial_spot": "16",
    "Peach___healthy": "17",
    "Pepper,_bell___Bacterial_spot": "18",
    "Pepper,_bell___healthy": "19",
    "Potato___Early_blight": "20",
    "Potato___Late_blight": "21",
    "Potato___healthy": "22",
    "Raspberry___healthy": "23",
    "Soybean___healthy": "24",
    "Squash___Powdery_mildew": "25",
    "Strawberry___Leaf_scorch": "26",
    "Strawberry___healthy": "27",
    "Tomato___Bacterial_spot": "28",
    "Tomato___Early_blight": "29",
    "Tomato___Late_blight": "30",
    "Tomato___Leaf_Mold": "31",
    "Tomato___Septoria_leaf_spot": "32",
    "Tomato___Spider_mites Two-spotted_spider_mite": "33",
    "Tomato___Target_Spot": "34",
    "Tomato___Tomato_Yellow_Leaf_Curl_Virus": "35",
    "Tomato___Tomato_mosaic_virus": "36",
    "Tomato___healthy": "37"
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "pooler_act": "tanh",
  "pooler_output_size": 768,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "transformers_version": "4.57.2"
}
